// pages/activity/game/arborDayRule/arborDayRule.js
Page({

    /**
     * 页面的初始数据
     */
    data: {
        rule_data:[
            {
                tag:'一、活动时间',
                content:'3月7日-3月12日'
            },
            {
                tag:'二、参与条件',
                content:'仅限家家悦优鲜到家门店参与'
            },
            {
                tag:'三、活动规则',
                content:'1.用户进入活动页面，通过获得水滴浇灌树苗，长成大树后可收获优惠券奖励；\n2.小树苗成长至大树共需要100水滴，用户每日可通过以下三种方式获得水滴:\n每日签到，可获得7水滴；\n浏览小程序任意页面停留15s，可获得8水滴(每日限领一次)；\n在优鲜小程序购买任意商品，可获得10水滴(每日限领一次);\n3.同一用户活动期间只限领取一次券包，其中包含：\n清风花萃植萃系列券25元一张（特价除外）；\n心相印云感系列券25元一张（特价除外）\n维达全品牌券25元一张（特价除外）；\n洁柔全品牌券25元一张（特价除外）；\n清风纸品满48减2优惠券一张；\n优惠券数量有限、先到先得，领完即止；\n4.如申请退款，视为自动放弃活动权益，水滴将自动扣除；'
            }
           
        
        ]

    },

    /**
     * 生命周期函数--监听页面加载
     */
    onLoad: function (options) {

    },

    /**
     * 生命周期函数--监听页面初次渲染完成
     */
    onReady: function () {

    },

    /**
     * 生命周期函数--监听页面显示
     */
    onShow: function () {

    },

    /**
     * 生命周期函数--监听页面隐藏
     */
    onHide: function () {

    },

    /**
     * 生命周期函数--监听页面卸载
     */
    onUnload: function () {

    },

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh: function () {

    },

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom: function () {

    },

    /**
     * 用户点击右上角分享
     */
    onShareAppMessage: function () {

    }
})